[

    {
        "bookId": 1,
        "bookName": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "image": "https://i.ibb.co/7SHJ1WX/3bcfd9c77441e2cf5d6ab35d6cfaca63.png",
        "review": "A timeless classic, delving into the complexities of the American Dream, love, and wealth. Fitzgerald's lyrical prose vividly paints the roaring 1920s, revealing the disillusionment beneath the glitz. Through vibrant characters, it explores themes of aspiration, decadence, and the pursuit of happiness.",
        "totalPages": 180,
        "rating": 4.5,
        "category": "Fiction",
        "tags": ["Classics", "Romance"],
        "publisher": "Scribner",
        "yearOfPublishing": 1925
    },
    {
        "bookId": 2,
        "bookName": "1984",
        "author": "George Orwell",
        "image": "https://i.ibb.co/5nNnkS4/4f3957e8f023d8d60bae77fda6c15279.png",
        "review": "Orwell's chilling masterpiece unveils a dystopian society suffocated by surveillance and controlled by totalitarianism. Through vivid imagery, he warns of the dangers of unchecked authority, urging readers to defend individual freedoms. A prophetic work that resonates with contemporary societal challenges and the eternal struggle for liberty.",
        "totalPages": 328,
        "rating": 4.8,
        "category": "Science Fiction",
        "tags": ["Dystopian", "Political"],
        "publisher": "Secker & Warburg",
        "yearOfPublishing": 1949
    },
    {
        "bookId": 3,
        "bookName": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "image": "https://i.ibb.co/R0fRYLN/9d64556d757ca419326dbb22159ff2ae.png",
        "review": "Harper Lee's unforgettable masterpiece navigates the complexities of racial injustice and moral growth through the innocent eyes of a child. With poignant prose, it challenges societal norms, advocating for empathy and equality in the face of pervasive prejudice. A timeless classic that inspires introspection and social change.",
        "totalPages": 281,
        "rating": 4.7,
        "category": "Fiction",
        "tags": ["Coming of Age", "Social Issues"],
        "publisher": "J. B. Lippincott & Co.",
        "yearOfPublishing": 1960
    },
    {
        "bookId": 4,
        "bookName": "The Catcher in the Rye",
        "author": "J.D. Salinger",
        "image": "https://i.ibb.co/HB6mdTZ/642f797cd362e163b10280a18e873752.png",
        "review": "Salinger's poignant narrative delves into teenage angst and disillusionment, encapsulating the essence of youth rebellion. Through Holden Caulfield's candid narration, it explores the search for authenticity in a world fraught with phoniness. An enduring classic that resonates with readers, capturing the complexities of adolescence and the human condition.",
        "totalPages": 224,
        "rating": 4.4,
        "category": "Fiction",
        "tags": ["Coming of Age", "Psychological"],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 1951
    },
    {
        "bookId": 5,
        "bookName": "Pride and Prejudice",
        "author": "Jane Austen",
        "image": "https://i.ibb.co/m9DPXsf/704abe9e421fa597d747e8b4e9bbcfb3.png",
        "review": "A witty and romantic masterpiece, Austen's novel satirizes the societal norms of the early 19th century. Through memorable characters and sharp social commentary, it explores themes of love, marriage, and the importance of self-awareness. A timeless classic that continues to captivate readers with its humor and insight.",
        "totalPages": 279,
        "rating": 4.6,
        "category": "Fiction",
        "tags": ["Romance", "Satire"],
        "publisher": "T. Egerton, Whitehall",
        "yearOfPublishing": 1813
    },
    {
        "bookId": 6,
        "bookName": "The Hobbit",
        "author": "J.R.R. Tolkien",
        "image": "https://i.ibb.co/9gxd811/713be2009ed5e0a38a726ba628d93944.png",
        "review": "Tolkien's enchanting tale follows Bilbo Baggins on an epic quest filled with magic and adventure. Through rich world-building and compelling storytelling, it transports readers to Middle-earth, where they encounter dwarves, dragons, and the transformative journey of a reluctant hero. A timeless fantasy classic that ignites the imagination.",
        "totalPages": 310,
        "rating": 4.9,
        "category": "Fantasy",
        "tags": ["Adventure", "Quest"],
        "publisher": "Allen & Unwin",
        "yearOfPublishing": 1937
    },
    {
        "bookId": 7,
        "bookName": "Crime and Punishment",
        "author": "Fyodor Dostoevsky",
        "image": "https://i.ibb.co/sVC1tZF/ce3004447af28acdb8c6fce01bf120bd.png",
        "review": "Dostoevsky's gripping novel delves deep into the psyche of its protagonist, Raskolnikov, as he grapples with guilt and morality in St. Petersburg. Through intricate characterizations and philosophical exploration, it explores themes of redemption and the consequences of human actions. A profound literary work that continues to captivate readers.",
        "totalPages": 576,
        "rating": 4.7,
        "category": "Fiction",
        "tags": ["Psychological", "Philosophical"],
        "publisher": "The Russian Messenger",
        "yearOfPublishing": 1866
    },
    {
        "bookId": 8,
        "bookName": "The Alchemist",
        "author": "Paulo Coelho",
        "image": "https://i.ibb.co/qDBbXSm/d3c7344e22a9684793d7a7fb662caac7.png",
        "review": "Coelho's allegorical masterpiece follows Santiago on a transformative journey to uncover the secrets of the universe and fulfill his destiny. Through mystical encounters and profound lessons, it explores themes of self-discovery, destiny, and the interconnectedness of all things. A deeply inspiring and thought-provoking tale that resonates with readers worldwide.",
        "totalPages": 197,
        "rating": 4.3,
        "category": "Fiction",
        "tags": ["Philosophical", "Inspirational"],
        "publisher": "HarperCollins",
        "yearOfPublishing": 1988
    },
    {
        "bookId": 9,
        "bookName": "The Lord of the Rings",
        "author": "J.R.R. Tolkien",
        "image": "https://i.ibb.co/MNt0FY7/fdd0e218554fda4443af36899ee3aa12.png",
        "review": "García Márquez's mesmerizing saga unfolds the multi-generational tale of the Buendía family in the fictional town of Macondo. Through magical realism and lyrical prose, it explores themes of love, solitude, and the cyclical nature of history. A literary masterpiece that captures the essence of Latin American culture and the human experience.",
        "totalPages": 1178,
        "rating": 4.9,
        "category": "Fantasy",
        "tags": ["Epic", "Adventure"],
        "publisher": "George Allen & Unwin",
        "yearOfPublishing": 1954
    }
]